Add mermaid.min.js and fix diagrams' errors
